tutorials/lagrangian/porousExplicitSourceReactingParcelFoam/filter/0.org/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.0449;

boundaryField
{
    walls
    {
        type            compressible::epsilonWallFunction;
        value           uniform 0.0449;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 0.0449;
    }
    outlet
    {
        type            zeroGradient;
    }
    cycLeft
    {
        type            cyclic;
        value           uniform 0.0449;
    }
    cycRight
    {
        type            cyclic;
        value           uniform 0.0449;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
